# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here
orders = pd.read_csv('Orders.zip')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
# your code here

#1. Setting expectations

#In this case, is evident that the amount_spent is the values that we have to sum for every CustomerID to assign to the corresponding ranges

In [4]:
#2. Collecting Information

customers_amounts = orders.groupby('CustomerID').agg({'amount_spent':'sum'}).reset_index()
display(customers_amounts)

# We can calculate the quantiles

amount_q95 = customers_amounts.quantile(.95)
amount_q75 = customers_amounts.quantile(.75)
display(amount_q95)
display(amount_q75)

# We can filter the amounts over the quantile 95 and between the quantiles 75 and 95

display(customers_amounts[customers_amounts['amount_spent'] >= amount_q95['amount_spent']])
display(customers_amounts[((customers_amounts['amount_spent'] >= amount_q75['amount_spent']) & 
                           (customers_amounts['amount_spent'] < amount_q95['amount_spent']))])

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
4          12350        334.40
...          ...           ...
4334       18280        180.60
4335       18281         80.82
4336       18282        178.05
4337       18283       2094.88
4338       18287       1837.28

[4339 rows x 2 columns]

CustomerID      17984.100
amount_spent     5840.182
Name: 0.95, dtype: float64

CustomerID      16778.50
amount_spent     1661.64
Name: 0.75, dtype: float64

      CustomerID  amount_spent
0          12346      77183.60
10         12357       6207.67
12         12359       6372.58
50         12409      11072.67
55         12415     124914.53
...          ...           ...
4207       18109       8052.97
4229       18139       8438.34
4253       18172       7561.68
4292       18223       6484.54
4298       18229       7276.90

[217 rows x 2 columns]

      CustomerID  amount_spent
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
5          12352       2506.04
9          12356       2811.43
...          ...           ...
4319       18259       2338.60
4320       18260       2643.20
4328       18272       3078.58
4337       18283       2094.88
4338       18287       1837.28

[868 rows x 2 columns]

In [5]:
#3. Reacting to Data / Revising Expectations

VIP = customers_amounts[customers_amounts['amount_spent'] >= amount_q95['amount_spent']].sort_values('amount_spent',ascending=False)
display(VIP)

Preferred = customers_amounts[((customers_amounts['amount_spent'] >= amount_q75['amount_spent']) & 
                           (customers_amounts['amount_spent'] < amount_q95['amount_spent']))].sort_values('amount_spent',ascending=False)
display(Preferred)

def clientGroup(client):
    if client in list(VIP['CustomerID']):
        return 'VIP'
    elif client in list(Preferred['CustomerID']):
        return 'Preferred'

orders['Client Group'] = orders['CustomerID'].apply(clientGroup)

display(orders)

      CustomerID  amount_spent
1690       14646     280206.02
4202       18102     259657.30
3729       17450     194550.79
3009       16446     168472.50
1880       14911     143825.06
...          ...           ...
1587       14505       5905.64
1516       14415       5900.28
1898       14944       5900.25
650        13209       5891.61
892        13534       5870.08

[217 rows x 2 columns]

      CustomerID  amount_spent
537        13050       5836.86
304        12720       5781.73
2105       15218       5756.89
3904       17686       5739.46
631        13178       5725.47
...          ...           ...
3880       17656       1674.69
2764       16115       1667.97
438        12912       1662.30
147        12530       1662.28
509        13012       1661.84

[868 rows x 2 columns]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,Client Group
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,Preferred
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,Preferred
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,Preferred
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,Preferred
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,Preferred
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20,None
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60,None
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60,None
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60,None
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85,None

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [10]:
# your code here

countries_VIP = orders[orders['Client Group'] == 'VIP'].groupby('Country').agg({'CustomerID':'nunique'}).reset_index().sort_values('CustomerID',ascending=False).rename(columns={'CustomerID':'Customers'})

display(countries_VIP)

            Country  Customers
17   United Kingdom        177
8           Germany         10
7            France          9
16      Switzerland          3
14            Spain          2
12         Portugal          2
0         Australia          2
5              EIRE          2
9             Japan          2
6           Finland          1
1           Belgium          1
10      Netherlands          1
11           Norway          1
4           Denmark          1
13        Singapore          1
3            Cyprus          1
15           Sweden          1
2   Channel Islands          1

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [12]:

# your code here

countries_VIP_Preferred = orders[((orders['Client Group'] == 'VIP') | (orders['Client Group'] == 'Preferred'))].groupby('Country').agg({'CustomerID':'nunique'}).reset_index().sort_values('CustomerID',ascending=False).rename(columns={'CustomerID':'Customers'})

display(countries_VIP_Preferred)

            Country  Customers
26   United Kingdom        932
10          Germany         39
9            France         29
2           Belgium         12
25      Switzerland          9
23            Spain          9
21         Portugal          7
19           Norway          7
14            Italy          5
8           Finland          5
15            Japan          4
0         Australia          4
5            Cyprus          4
4   Channel Islands          4
1           Austria          3
7              EIRE          3
6           Denmark          3
24           Sweden          2
13           Israel          2
12          Iceland          1
11           Greece          1
16          Lebanon          1
17            Malta          1
18      Netherlands          1
20           Poland          1
22        Singapore          1
3            Canada          1